CSI API ETABS v1

# eFramePropType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eFramePropType

    Public Enumeration eFramePropType

    Dim instance As eFramePropType

    public enum class eFramePropType

    type eFramePropType

Members

| Member name| Value| Description
---|---|---|---
| I| 1|
| Channel| 2|
| T| 3|
| Angle| 4|
| DblAngle| 5|
| Box| 6|
| Pipe| 7|
| Rectangular| 8|
| Circle| 9|
| General| 10|
| DbChannel| 11|
| Auto| 12|
| SD| 13|
| Variable| 14|
| Joist| 15|
| Bridge| 16|
| Cold_C| 17|
| Cold_2C| 18|
| Cold_Z| 19|
| Cold_L| 20|
| Cold_2L| 21|
| Cold_Hat| 22|
| BuiltupICoverplate| 23|
| PCCGirderI| 24|
| PCCGirderU| 25|
| BuiltupIHybrid| 26|
| BuiltupUHybrid| 27|
| Concrete_L| 28|
| FilledTube| 29|
| FilledPipe| 30|
| EncasedRectangle| 31|
| EncasedCircle| 32|
| BucklingRestrainedBrace| 33|
| CoreBrace_BRB| 34|
| ConcreteTee| 35|
| ConcreteBox| 36|
| ConcretePipe| 37|
| ConcreteCross| 38|
| SteelPlate| 39|
| SteelRod| 40|
| PCCGirderSuperT| 41|
| Cold_Box| 42|
| Cold_I| 43|
| Cold_Pipe| 44|
| Cold_T| 45|
| Trapezoidal| 46|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com